Autorizadores/E-Receita/M3143302/Exemplos/envelopamento/SubstituirNfse.xml

<?xml version="1.0" encoding="ISO-8859-1"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><SubstituirNfseRequest xmlns="http://www.ereceita.net.br/soap/NfseWebService"><nfseCabecMsg>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;cabecalho versao=&quot;2.02&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot;&gt;
   &lt;versaoDados&gt;2.02&lt;/versaoDados&gt;
&lt;/cabecalho&gt;
</nfseCabecMsg><nfseDadosMsg>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;SubstituirNfseEnvio xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot;&gt;&lt;SubstituicaoNfse Id=&quot;SNF1&quot;&gt;&lt;Pedido&gt;&lt;InfPedidoCancelamento Id=&quot;PDD1&quot;&gt;&lt;IdentificacaoNfse&gt;&lt;Numero&gt;201500000010001&lt;/Numero&gt;&lt;CpfCnpj&gt;&lt;Cnpj&gt;99999999999999&lt;/Cnpj&gt;&lt;/CpfCnpj&gt;&lt;InscricaoMunicipal&gt;9.9.99999999&lt;/InscricaoMunicipal&gt;&lt;CodigoMunicipio&gt;3106200&lt;/CodigoMunicipio&gt;&lt;/IdentificacaoNfse&gt;&lt;CodigoCancelamento&gt;2&lt;/CodigoCancelamento&gt;&lt;/InfPedidoCancelamento&gt;&lt;Signature xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot;&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;SignatureMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#rsa-sha1&quot;/&gt;&lt;Reference URI=&quot;#PDD1&quot;&gt;&lt;Transforms&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#enveloped-signature&quot;/&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;/Transforms&gt;&lt;DigestMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#sha1&quot;/&gt;&lt;DigestValue&gt;2wmvePly63Wdm6dJPo3w2U7Br9k=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;imaOT2TGO2URdwONz9hVTuwBN2IwD2jBTjWu6qet9orUQXO6/3SfpkGSJCmVnvn/gHqlNouAPFZ295v1OCIK91TlMF3RJ40tMfUxs6f9actbUBPfVeAX8FaE0Oxjq8p6qvR277aAm3iGcUMR6Yqr8UcTPRoFTNwwVGN8YhdhH7o=&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIICVTCCAb4CCQD3A3l4B6OnbTANBgkqhkiG9w0BAQsFADBvMQswCQYDVQQGEwJCUjELMAkGA1UECAwCTUcxCzAJBgNVBAcMAkJIMQwwCgYDVQQKDANSUFAxCzAJBgNVBAsMAlRJMQwwCgYDVQQDDANBVkExHTAbBgkqhkiG9w0BCQEWDmF2YUBycHAuY29tLmJyMB4XDTE0MTIwMjEyNTU0MloXDTE1MTIwMjEyNTU0MlowbzELMAkGA1UEBhMCQlIxCzAJBgNVBAgMAk1HMQswCQYDVQQHDAJCSDEMMAoGA1UECgwDUlBQMQswCQYDVQQLDAJUSTEMMAoGA1UEAwwDQVZBMR0wGwYJKoZIhvcNAQkBFg5hdmFAcnBwLmNvbS5icjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtJ98TqJNetG7QTT5j/oV/9LUf+BnNe3I9L097xGy19WbMJikUo+FvQ3o/eL0m/tCTY6zeMAZeuafQqhDaz4duz7+WTJ6BBKy5ZX2lu39bl3S7bbAIm3vwNaKKf2PIEHPKe3zg2dLGh6p6UeLq4ULu4JZG11++lA8Mf1m8c5hN2UCAwEAATANBgkqhkiG9w0BAQsFAAOBgQCgJ8rS8Yq28tS5SM0ovAD6GMoRJpHqi6bj+nvzy6EB8XQvyK80bX84wBVFjWYccIayHICpz27sckFgd70kNDWs2biFVNj9FeCx8qpazL9/i+cgHLRf6tSKOkdlKNeBiD20OnpnKlPiMPqYEVdfQUfNWp0ru8ylBHS4J+lS5oeRlA==&lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/Pedido&gt;&lt;Rps&gt;&lt;InfDeclaracaoPrestacaoServico Id=&quot;RPS1&quot;&gt;&lt;Rps&gt;&lt;IdentificacaoRps&gt;&lt;Numero&gt;9999999994&lt;/Numero&gt;&lt;Serie&gt;UNICA&lt;/Serie&gt;&lt;Tipo&gt;1&lt;/Tipo&gt;&lt;/IdentificacaoRps&gt;&lt;DataEmissao&gt;2015-03-03&lt;/DataEmissao&gt;&lt;Status&gt;1&lt;/Status&gt;&lt;/Rps&gt;&lt;Competencia&gt;2015-03-03&lt;/Competencia&gt;&lt;Servico&gt;&lt;Valores&gt;&lt;ValorServicos&gt;100000.00&lt;/ValorServicos&gt;&lt;ValorDeducoes&gt;10.00&lt;/ValorDeducoes&gt;&lt;ValorPis&gt;40.00&lt;/ValorPis&gt;&lt;ValorCofins&gt;50.00&lt;/ValorCofins&gt;&lt;ValorInss&gt;60.00&lt;/ValorInss&gt;&lt;ValorIr&gt;70.00&lt;/ValorIr&gt;&lt;ValorCsll&gt;80.00&lt;/ValorCsll&gt;&lt;OutrasRetencoes&gt;30.00&lt;/OutrasRetencoes&gt;&lt;ValorIss&gt;2999.40&lt;/ValorIss&gt;&lt;Aliquota&gt;3.00&lt;/Aliquota&gt;&lt;DescontoIncondicionado&gt;10.00&lt;/DescontoIncondicionado&gt;&lt;DescontoCondicionado&gt;20.00&lt;/DescontoCondicionado&gt;&lt;/Valores&gt;&lt;IssRetido&gt;1&lt;/IssRetido&gt;&lt;ResponsavelRetencao&gt;1&lt;/ResponsavelRetencao&gt;&lt;ItemListaServico&gt;14.01&lt;/ItemListaServico&gt;&lt;CodigoCnae&gt;4520001&lt;/CodigoCnae&gt;&lt;Discriminacao&gt;teste&lt;/Discriminacao&gt;&lt;CodigoMunicipio&gt;3106200&lt;/CodigoMunicipio&gt;&lt;CodigoPais&gt;1058&lt;/CodigoPais&gt;&lt;ExigibilidadeISS&gt;1&lt;/ExigibilidadeISS&gt;&lt;MunicipioIncidencia&gt;3106200&lt;/MunicipioIncidencia&gt;&lt;/Servico&gt;&lt;Prestador&gt;&lt;CpfCnpj&gt;&lt;Cnpj&gt;99999999999999&lt;/Cnpj&gt;&lt;/CpfCnpj&gt;&lt;InscricaoMunicipal&gt;9.9.99999999&lt;/InscricaoMunicipal&gt;&lt;/Prestador&gt;&lt;Tomador&gt;&lt;IdentificacaoTomador&gt;&lt;CpfCnpj&gt;&lt;Cnpj&gt;88888888888888&lt;/Cnpj&gt;&lt;/CpfCnpj&gt;&lt;InscricaoMunicipal&gt;8.8.88888888&lt;/InscricaoMunicipal&gt;&lt;/IdentificacaoTomador&gt;&lt;RazaoSocial&gt;Razao Social do Tomador&lt;/RazaoSocial&gt;&lt;Endereco&gt;&lt;Endereco&gt;Endereco do Tomador&lt;/Endereco&gt;&lt;Numero&gt;1720&lt;/Numero&gt;&lt;Bairro&gt;Centro&lt;/Bairro&gt;&lt;CodigoMunicipio&gt;3106200&lt;/CodigoMunicipio&gt;&lt;Uf&gt;MG&lt;/Uf&gt;&lt;CodigoPais&gt;1058&lt;/CodigoPais&gt;&lt;Cep&gt;31000000&lt;/Cep&gt;&lt;/Endereco&gt;&lt;Contato&gt;&lt;Email&gt;email_do_tomador@gmail.com&lt;/Email&gt;&lt;/Contato&gt;&lt;/Tomador&gt;&lt;OptanteSimplesNacional&gt;2&lt;/OptanteSimplesNacional&gt;&lt;IncentivoFiscal&gt;2&lt;/IncentivoFiscal&gt;&lt;/InfDeclaracaoPrestacaoServico&gt;&lt;Signature xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot;&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;SignatureMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#rsa-sha1&quot;/&gt;&lt;Reference URI=&quot;#RPS1&quot;&gt;&lt;Transforms&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#enveloped-signature&quot;/&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;/Transforms&gt;&lt;DigestMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#sha1&quot;/&gt;&lt;DigestValue&gt;ssJJr6yiaDH37DE3rbGo7c9nCeI=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;sgFzEbyqc3ob3LfIKAzFHNRsHK4yfwt1ajPepogoBoqIbqTfl2Ls2k77GMe4GdcTRE1myoNI+v5Xl9SgyoXv2gcnUG41iEHBdOr4yNhnpuEYulen6I5prD1fiOv/qqJxOXZN7mhCCjC1tGFUKvP1AaY4Kt8QzcHvT0EMh0JjrY0=&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIICVTCCAb4CCQD3A3l4B6OnbTANBgkqhkiG9w0BAQsFADBvMQswCQYDVQQGEwJCUjELMAkGA1UECAwCTUcxCzAJBgNVBAcMAkJIMQwwCgYDVQQKDANSUFAxCzAJBgNVBAsMAlRJMQwwCgYDVQQDDANBVkExHTAbBgkqhkiG9w0BCQEWDmF2YUBycHAuY29tLmJyMB4XDTE0MTIwMjEyNTU0MloXDTE1MTIwMjEyNTU0MlowbzELMAkGA1UEBhMCQlIxCzAJBgNVBAgMAk1HMQswCQYDVQQHDAJCSDEMMAoGA1UECgwDUlBQMQswCQYDVQQLDAJUSTEMMAoGA1UEAwwDQVZBMR0wGwYJKoZIhvcNAQkBFg5hdmFAcnBwLmNvbS5icjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtJ98TqJNetG7QTT5j/oV/9LUf+BnNe3I9L097xGy19WbMJikUo+FvQ3o/eL0m/tCTY6zeMAZeuafQqhDaz4duz7+WTJ6BBKy5ZX2lu39bl3S7bbAIm3vwNaKKf2PIEHPKe3zg2dLGh6p6UeLq4ULu4JZG11++lA8Mf1m8c5hN2UCAwEAATANBgkqhkiG9w0BAQsFAAOBgQCgJ8rS8Yq28tS5SM0ovAD6GMoRJpHqi6bj+nvzy6EB8XQvyK80bX84wBVFjWYccIayHICpz27sckFgd70kNDWs2biFVNj9FeCx8qpazL9/i+cgHLRf6tSKOkdlKNeBiD20OnpnKlPiMPqYEVdfQUfNWp0ru8ylBHS4J+lS5oeRlA==&lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/Rps&gt;&lt;/SubstituicaoNfse&gt;&lt;Signature xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot;&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;SignatureMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#rsa-sha1&quot;/&gt;&lt;Reference URI=&quot;#SNF1&quot;&gt;&lt;Transforms&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#enveloped-signature&quot;/&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;/Transforms&gt;&lt;DigestMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#sha1&quot;/&gt;&lt;DigestValue&gt;YYjYNVWYfM0DMG81VfwdP5bsfF0=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;foR/kErMw5luF7S1O8ir5ODPikLGR4iDeoT3SpKSg1hakk/SLq/tt3CO83C+29RIHpuzrovMBxmq/o11aIK6KQyORt0k7APhSfDYbvxYtrHd5VYOg7BSBlM4HiAf8+GACFOANbJuiE/UKhYHscE9mV1+xrfLdVsMq6KdT7Ve8Us=&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIICVTCCAb4CCQD3A3l4B6OnbTANBgkqhkiG9w0BAQsFADBvMQswCQYDVQQGEwJCUjELMAkGA1UECAwCTUcxCzAJBgNVBAcMAkJIMQwwCgYDVQQKDANSUFAxCzAJBgNVBAsMAlRJMQwwCgYDVQQDDANBVkExHTAbBgkqhkiG9w0BCQEWDmF2YUBycHAuY29tLmJyMB4XDTE0MTIwMjEyNTU0MloXDTE1MTIwMjEyNTU0MlowbzELMAkGA1UEBhMCQlIxCzAJBgNVBAgMAk1HMQswCQYDVQQHDAJCSDEMMAoGA1UECgwDUlBQMQswCQYDVQQLDAJUSTEMMAoGA1UEAwwDQVZBMR0wGwYJKoZIhvcNAQkBFg5hdmFAcnBwLmNvbS5icjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtJ98TqJNetG7QTT5j/oV/9LUf+BnNe3I9L097xGy19WbMJikUo+FvQ3o/eL0m/tCTY6zeMAZeuafQqhDaz4duz7+WTJ6BBKy5ZX2lu39bl3S7bbAIm3vwNaKKf2PIEHPKe3zg2dLGh6p6UeLq4ULu4JZG11++lA8Mf1m8c5hN2UCAwEAATANBgkqhkiG9w0BAQsFAAOBgQCgJ8rS8Yq28tS5SM0ovAD6GMoRJpHqi6bj+nvzy6EB8XQvyK80bX84wBVFjWYccIayHICpz27sckFgd70kNDWs2biFVNj9FeCx8qpazL9/i+cgHLRf6tSKOkdlKNeBiD20OnpnKlPiMPqYEVdfQUfNWp0ru8ylBHS4J+lS5oeRlA==&lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/SubstituirNfseEnvio&gt;
</nfseDadosMsg></SubstituirNfseRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
